change_detect_whole_think_prompt="""请你根据输入的两张图片，依照<要求>，识别它们存在的差异。

<差异类型>
- 位置差异：两张图中相对位置上相同元素存在差异，比如图1中猫元素比图2猫元素更偏上一些；
- 颜色差异：图中相同元素颜色不一样，元素设计形状、图层、线条等；
- 内容差异：在相对位置区域，两张图呈现的内容不同，比如元素不同，一张图是一只鸟，另一张图是一条鱼；
- 大小差异：相同元素大小存在差异；
- 文本差异：包含字体形状、字体样式、字体颜色、字体内容的差异；

<输出格式>
<think>
--思考过程...
</think>

<output>
结论：共有2处差异

**差异1**
图1坐标：<box>[712,805,922,859]</box>
图2坐标：<box>[726,795,942,857]</box>
解释：颜色差异，第一张图片底部的小猫衣服图案是红色，第二张图片底部的小猫衣服图案是橙色，两张图片存在局部颜色差异

**差异2**
图1坐标：<box>[154,868,830,937]</box>
图2坐标：<box>[154,866,833,937]</box>
解释：标点符号不同，图1文本为“未经蒸煮、干燥、冷冻、水解等处理过程”，图2文本为“未经蒸煮，干燥，冷冻，水解等处理过程”，图1为顿号，图2为逗号
</output>

<要求>
1. 请仔细对照两种图片，找出它们在相应位置存在哪些差异,具体差异可以从<差异类型>定义的维度去判断；
2. 识别出所有差异后，请按<输出格式>进行输出，具体包含：1）识别的思考过程，放入<think></think>标签中；2）输出结果，放入<output></output>标签，结果包含结论和每个差异的坐标信息和解释描述信息
3. 坐标box是按照[x1,y1,x2,y2]形式，其中具体值是图片的真实绝对坐标；输出格式要严格按照<box>[]</box>格式;
4. 如果两张图没有发现差异，就输出“结论：没有发现差异”；

请深呼吸，然后一步步找出两张图片中存在的差异
"""


change_detect_position_think_prompt="""请你根据输入的两张图片，依照<要求>，识别它们是否存在元素位置上的差异。

<差异定义>
- 两张图中相同元素在所处的相对位置存在差异，如图1中的猫元素比图2中的猫更偏顶部；
- 位置差异包含上下、左右、中间、包含等等位置上的不同；
- 该差异一定是非常明显的，若不明显，就视为不属于该差异；因为两张原图尺寸是存在差异的，所以一定要根据相对位置，且差异特别明显

<输出格式>
<think>
--思考过程...
</think>

<output>
结论：共有2处差异

**差异1**
图1坐标：<box>[712,805,922,859]</box>
图2坐标：<box>[726,799,933,857]</box>
解释：位置差异，第一张图片卡通人物形象相比第二张图片的卡通人物更偏左侧位置；

**差异2**
图1坐标：<box>[149,868,830,937]</box>
图2坐标：<box>[154,866,833,937]</box>
解释：位置差异，两张图中苹果元素的位置存在差异，图1中苹果比图2中的而苹果更接近底部位置；
</output>

<要求>
1. 请仔细对照两种图片，找出它们在是否存在位置上差异,具体差异可以从<差异定义>的维度去判断；
2. 识别出所有差异后，请按<输出格式>进行输出，具体包含：1）识别的思考过程，放入<think></think>标签中；2）输出结果，放入<output></output>标签，结果包含结论和每个差异的坐标信息和解释描述信息
3. 坐标box是按照[x1,y1,x2,y2]形式，其中具体值是图片的真实绝对坐标；输出格式要严格按照<box>[]</box>格式;
4. 请注意：只识别元素存在的位置差异，其他差异（如颜色不同、内容不同等）忽略；
5. 如果两张图没有发现位置上的差异，就输出“结论：没有发现位置上的差异”；

请深呼吸，然后一步步找出两张图片中存在的位置上的差异
"""


change_detect_text_think_prompt="""请你根据输入的两张图片，依照<要求>，识别它们是否存在文本元素上的差异。

<差异定义>
- 判断两张图中相对位置上相同的文本类元素是否存在差异；
- 具体差异包含：文本内容、文本颜色、文本大小、文本字体样式，文本排列等；


<输出格式>
<think>
--思考过程...
</think>

<output>
结论：共有2处差异

**差异1**
图1坐标：<box>[712,804,923,858]</box>
图2坐标：<box>[726,799,933,857]</box>
解释：文本颜色差异，第一张图片中显示的文本“hello”是黑色，而第二张图片中显示的文本“hello”是红色；

**差异2**
图1坐标：<box>[149,868,830,937]</box>
图2坐标：<box>[155,866,833,939]</box>
解释：字体样式差异，两张图中左侧的竖排文本字体样式不同，图1显示字体更浑厚，而图2显示的字体更锐利；
</output>

<要求>
1. 请仔细对照两种图片，找出它们在是否存在文本类元素的差异,具体差异可以从<差异定义>的维度去判断；
2. 识别出所有差异后，请按<输出格式>进行输出，具体包含：1）识别的思考过程，放入<think></think>标签中；2）输出结果，放入<output></output>标签，结果包含结论和每个差异的坐标信息和解释描述信息
3. 坐标box是按照[x1,y1,x2,y2]形式，其中具体值是图片的真实绝对坐标；输出格式要严格按照<box>[]</box>格式;
4. 请注意：只识别文本类元素存在的差异，其他差异（如颜色不同、内容不同等）忽略；
5. 如果两张图没有发现文本上的差异，就输出“结论：没有发现文本类的差异”；

请深呼吸，然后一步步找出两张图片中存在的文本类差异
"""



text_similarity_prompt = """请根据<要求>，帮判断提供差异描述的句子是否相同的。

<样例>
#input
S0：颜色存在差异，第一张图中猫的颜色的黑白相间的，而第二张图猫的黑色的
S1：位置不一样：图1中猫更靠近图片的左侧，而图2的猫更靠中间位置
S2：颜色不同，两张图在猫元素上颜色不一样，图1是中猫是黑白猫，图2是纯灰色猫；
S3：样式不同，图1中的字体是正楷体样式，而图2是行书样式
S4：字体不同，图1字体看起来更正方，而图2的字体看起来更潦草
S5：颜色不一样，两张图猫元素在颜色存在差异
S6：颜色不同，两张图的花朵颜色存在差异

#output
[[0,2,4],[1,6],[3],[5]]

<定义>
- 每个句子包含差异类型、差异主体、差异详细描述等信息
- 两个句子是否相同，主要判断差它们包含的异类型与差异主体是否一样，如果都一样，就算是相同的；
- 如果差异的详细描述有点差异，但主体与差异类型是一样的，也认为是相同的，如<样例>中S1与S3，关于图2中的猫具体颜色存在差异，但差异类型与主体都是一样，所以认为这两个句子是相同的
- 如果差异类型与差异主体有一个不一样，就认为这两个句子是不相同的，如<样例>中的S5与S6,前者差异主体是猫，而后者是花朵，所以认为二者是不相同的；

<输入>
{input_text}

<要求>
1. 根据<定义>和<样例>判断<输入>所提供的句子列表那些是相同的，那些是不同的
2. 输出结果参考<样例>中#output定义的输出格式：将相同的句子对应编号放在同一个的列表中，没有相同的句子单独放在一个列表；
3. 注意：输出的结果中，每个句子编号只能出现一次，且不能遗漏；
4. 如果输入的句子都不相同，也要输出对应结果，如输入的是三个句子，则输出的结果为：[[0],[1],[2]]

直接输出结果列表，不要做任何思考与解释
"""
